outputs/openfoam_cases/0006/constant/waveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	2.0;
    format	ascii;
    class	dictionary;
    object	waveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

seaLevel            -0.02;

seaLevelAsReference true;

relaxationNames     ( inlet );

initializationName  init;

inletCoeffs
{
    waveType            irregular;
    spectrum            JONSWAP;
    N                   200;
    Tsoft               24;
    Hs                  2.24;
    Tp                  15.11;
    gamma               3.3;
    depth               14.1;
    direction           ( 1 0 0 );
    spectramValues  nonuniform List<scalar> 
201
(
3.8298e-15
4.65125e-12
1.1415e-09
8.4466e-08
2.51777e-06
3.73895e-05
0.000323852
0.00184149
...
)
;

    fspectrum       nonuniform List<scalar> 
201
(
0.0277778
0.0292138
0.0306477
0.0320776
0.0335016
0.0349175
0.0363234
0.0377174
...
)
;

    amplitude           nonuniform List<scalar>
    200
    (
        8.17587e-08
        1.282e-06
        1.1064e-05
        6.08718e-05
        0.000237708
        0.000712656
        0.00173737
        0.00359414
...
    );
    frequency           nonuniform List<scalar>
    200
    (
        0.0284958
        0.0299307
        0.0313627
        0.0327896
        0.0342095
        0.0356204
        0.0370204
        0.0384074
...
    );
    phaselag            nonuniform List<scalar>
    200
    (
        1.12089
        2.51125
        1.04677
        1.3328
        0.389154
        0.340234
        1.73206
        0.300068
...
    );
    waveNumber          nonuniform List<vector>
    200
    (
        (0.0153415 0 0)
        (0.0161269 0 0)
        (0.0169126 0 0)
        (0.0176976 0 0)
        (0.0184808 0 0)
        (0.0192612 0 0)
        (0.0200378 0 0)
        (0.0208094 0 0)
...
    );

    frequencyAxis
    {
        discretisation      cosineStretchedFrequencyAxis;
        lowerFrequencyCutoff 0.0277778;
        upperFrequencyCutoff 0.25;
        writeSpectrum       true;
    }

    relaxationZone
    {
        relaxationScheme    Spatial;
        relaxationShape     Rectangular;
        beachType           Empty;
        relaxType           INLET;
        startX              ( 0 0 -1 );
        endX                ( 400 0 1 );
        orientation         ( 1 0 0 );
        fieldNames          ( alpha.water U );
    }
}

initCoeffs
{
    waveType            potentialCurrent;
    U                   ( 0 0 0 );
    Tsoft               24;
}



// ************************************************************************* //
